public/school/english/dethroning-demo.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Dethroning Demo</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://www.haider.gq/base/stylesheet.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Dethroning Demo</h1>

<div id="outline-container-org221c534" class="outline-2">
<h2 id="org221c534"><a href="#org221c534">Dethroning Demo</a></h2>
<div class="outline-text-2" id="text-org221c534">
<p>
Dethroning (the upcoming game) is coming with a free game that is 
</p>
</div>
</div>
<div id="outline-container-org85df425" class="outline-2">
<h2 id="org85df425"><a href="#org85df425">NOTE</a></h2>
<div class="outline-text-2" id="text-org85df425">
<p>
This game is in a very early stage. Expect bugs, crashes, memory errors and any unstable behavior.
You can file a error on the demo&rsquo;s git repository page.
</p>
</div>
</div>
<div id="outline-container-orgc90a11a" class="outline-2">
<h2 id="orgc90a11a"><a href="#orgc90a11a">Git repository</a></h2>
<div class="outline-text-2" id="text-orgc90a11a">
<p>
Which is already in the works and could be found here: <a href="https://github.com/Haider-Mirza/Dethroning">Git Repository</a>.
The game is Free softwware and is licensed under the <b>GNU Public License v3</b>.
</p>
</div>
</div>

<div id="outline-container-orge10c9dd" class="outline-2">
<h2 id="orge10c9dd"><a href="#orge10c9dd">How to build the game</a></h2>
<div class="outline-text-2" id="text-orge10c9dd">
<p>
If you use the GNU Guix package manager, you can run the command &ldquo;guix shell -m manifest.scm&rdquo; to create a seperate programming environment.
You can read more about this feature in the Guix Manual: <a href="https://guix.gnu.org/en/manual/devel/en/guix.html#Invoking-guix-shell">Guix Shell</a> 
</p>

<p>
If you dont use the Guix Package manager and cannot use the pre-built binary located in the <b>./bin/</b>.
Launch a terminal and go into the project&rsquo;s root directory then run the command, <b>make all</b>.
Make sure you have all of the dependencies required installed. These are listed in the manifest.scm file.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.2 (<a href="https://orgmode.org">Org</a> mode 9.5.2)</p>
</div>
</body>
</html>
